In [1]:
import pandas
data = pandas.read_csv('train.csv', index_col='PassengerId')

Данные будут загружены в виде DataFrame, с помощью которого можно удобно работать с ними. В данном случае параметр

index_col='PassengerId'
означает, что колонка PassengerId задает нумерацию строк данного датафрейма.

Для того, чтобы посмотреть что представляют из себя данные, можно воспользоваться несколькими способами:

* более привычным с точки зрения Python (если индекс указывается только один, то производится выбор строк):

In [2]:
data[:10]

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

* или же воспользоваться методом датафрейма:

In [3]:
data.head(10)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

Один из способов доступа к столбцам датафрейма — использовать квадратные скобки и название столбца:

In [8]:
data['Sex']

PassengerId
1        male
2      female
3      female
4      female
5        male
        ...
887      male
888    female
889    female
890      male
891      male
Name: Sex, Length: 891, dtype: object

Для подсчета некоторых статистик (количества, среднее, максимум, минимум) можно также использовать методы датафрейма:

In [5]:
data['Sex'].value_counts()

PENIS

1.Какое количество мужчин и женщин ехало на корабле?

In [6]:
data['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

2.Какой части пассажиров удалось выжить? Посчитайте долю выживших пассажиров.

In [7]:
data['Survived'].value_counts(normalize=True)[1]

0.3838383838383838

3.Какую долю пассажиры первого класса составляли среди всех пассажиров?

In [12]:
data['Pclass'].value_counts(normalize=True)[1]

0.24242424242424243

4. Какого возраста были пассажиры? Посчитайте среднее и медиану возраста пассажиров.

In [13]:
data['Age'].mean()

29.69911764705882

In [14]:
data['Age'].median()

28.0

5. Коррелируют ли число братьев/сестер/супругов с числом родителей/детей? Посчитайте корреляцию Пирсона между признаками SibSp и Parch.

In [15]:
data['SibSp'].corr(data['Parch'],method='pearson')

0.41483769862015557

6. Какое самое популярное женское имя на корабле? Извлеките из полного имени пассажира (колонка Name) его личное имя (First Name). Это задание — типичный пример того, с чем сталкивается специалист по анализу данных. Данные очень разнородные и шумные, но из них требуется извлечь необходимую информацию. Попробуйте вручную разобрать несколько значений столбца Name и выработать правило для извлечения имен, а также разделения их на женские и мужские.

In [8]:
#Регуляркой разбиваем миссис и мисс по столбикам
Names = data.query("Sex==\'female\'")['Name'].str.extract('^.+?Mrs\..+?\((.+?)\)|^.+?Miss\.\s([\w\s]+)',expand=False)
Names.fillna('',inplace=True)
Names['Combine']=Names.apply(lambda x:'%s%s' %(x[0],x[1]),axis=1)
Names.drop([0,1],axis=1,inplace=True)
female_names = []
for i in range(Names['Combine'].count()):
    words = Names['Combine'].iloc[i].split(' ')
    for word in words:
        if len(word) > 2:
            female_names.append(word)
df = pandas.DataFrame(data=female_names,columns=['Names'])
print(df['Names'].value_counts())

Mary         18
Anna         17
Elizabeth    14
Margaret     12
Maria        11
             ..
Aloisia       1
Hunt          1
Theodosia     1
Kornelia      1
Norton        1
Name: Names, Length: 364, dtype: int64